import { Router } from "express";
import mealController from "../controllers/mealController.js";
import userController from "../controllers/userController.js";
import { body } from "express-validator"; // импортируем функцию body из express-validator для валидации тела запроса,в данном случае импортируем вручную,так как автоматически не импортируется
import authMiddleware from "../middlewares/authMiddleware.js";

const router = new Router(); // создаем объект на основе этого класса Router

router.get('/getMeals',mealController.getMeals); // описываем get запрос на сервере,первым параметром указываем url,по которому этот эндпоинт будет отрабатывать,а вторым передаем функцию,которая будет срабатывать на этом эндпоинте(по этому url)

router.get('/getMealsCatalog',mealController.getMealsCatalog); // описываем get запрос на сервере для получения блюд для каталога

router.get('/getMealsCatalog/:id',mealController.getMealId); // описываем get запрос на сервере для получения объекта блюда по id,указываем этот динамический параметр id через : (двоеточие) в url к этому эндпоинту


router.post('/createComment',userController.createComment); // создаем post запрос на создание комментария в базе данных

router.get('/getCommentsForProduct',userController.getCommentsForProduct); // создаем get запрос на получение комментариев для определенного товара

router.put('/updateProductRating',userController.updateProductRating); // создаем put запрос для обновления рейтинга товара 

router.put('/updateProductRatingCart',userController.updateProductRatingCart); // создаем put запрос для обновления рейтинга товара корзины


router.post('/createMealCart',mealController.createMealCart); // создаем post запрос для создания товара(блюда) в корзине

router.get('/getAllMealsCart',mealController.getAllMealsCart); // создаем get запрос на получение товаров(блюд) корзины для определенного авторизованного пользователя

router.put('/updateCartMeal',mealController.updateCartMeal); // создаем put запрос на обновление данных товара(блюда) корзины

router.delete('/deleteCartMeal/:mealId',mealController.deleteCartMeal); // создаем delete запрос на удаление товара(блюда) корзины, delete запрос не имеет тела запроса и все query параметры передаются через строку запроса,в данном случае передаем через двоеточие query параметр mealId(id товара(блюда) корзины,который нужно удалить)


router.put('/changeAccInfo',authMiddleware,body('email').isEmail(),userController.changeAccInfo);  // указываем put запрос для изменения данных пользователя в базе данных,вторым параметром указываем authMiddleware для проверки на access токен у пользователя,если он есть и он еще годен по сроку жизни этого токена(мы этот срок указали при создании токена),то будет выполнена функция changeAccInfo,если нет,то не будет и будет ошибка,если access токен пользователя иссяк(уже не годен по сроку годности),то будет идти повторный запрос на /refresh для обновления refresh и access токенов(это мы прописывали на фронтенде для нашего axios),refresh и access токены будут обновлены,если текущий refresh токен пользователя еще годен по сроку годности(это мы прописывали в функции для эндпоинта /refresh),если текущий refresh токен еще годен по сроку годности,то будут обновлены refresh и access токены и после этого будет идти повторный запрос(это мы прописывали на фронтенде для нашего axios) на изменение пароля пользователя,но уже с обновленными refresh и access токенами,если же при повторном запросе на /refresh refresh токен пользователя иссяк (уже не годен по сроку годности),то будет ошибка и не будет выполнена функция изменения пароля пользователя, третьим параметром указываем middleware(функцию body для валидации),указываем в параметре body() названия поля из тела запроса,которое хотим провалидировать(в данном случае это email),и указываем валидатор isEmail() для проверки на email

router.put('/changeAccPass',authMiddleware,userController.changeAccPass); // создаем put запрос для изменения пароля пользователя в базе данных,вторым параметром указываем наш authMiddleware для проверки на access токен у пользователя,если он есть и он еще годен по сроку жизни этого токена(мы этот срок указали при создании токена),то будет выполнена функция changeAccPass,если нет,то не будет и будет ошибка,если access токен пользователя иссяк(уже не годен по сроку годности),то будет идти повторный запрос на /refresh для обновления refresh и access токенов(это мы прописывали на фронтенде для нашего axios),refresh и access токены будут обновлены,если текущий refresh токен пользователя еще годен по сроку годности(это мы прописывали в функции для эндпоинта /refresh),если текущий refresh токен еще годен по сроку годности,то будут обновлены refresh и access токены и после этого будет идти повторный запрос(это мы прописывали на фронтенде для нашего axios) на изменение пароля пользователя,но уже с обновленными refresh и access токенами,если же при повторном запросе на /refresh refresh токен пользователя иссяк (уже не годен по сроку годности),то будет ошибка и не будет выполнена функция изменения пароля пользователя


router.post('/uploadFile',authMiddleware,userController.uploadFile); // указываем post запрос для загрузки файла с фронтенда на наш node js сервер(в данном случае в папку static),вторым параметром указываем наш authMiddleware для проверки на access токен

router.delete('/deleteFile/:fileName',userController.deleteFile); // указываем delete запрос для удаления файла с нашего node js сервера(в данном случае из папки static),delete запрос не имеет тела запроса и все параметры передаются через строку,тут указываем через :(двоеточие) динамический параметр fileName,то есть этот параметр может меняться(в данном случае этот параметр нужен,чтобы удалить файл из папки static по этому названию fileName)

router.post('/addNewMealCatalog',authMiddleware,userController.addNewMealCatalog); // создаем post запрос для создания нового товара в базе данных

router.post('/deleteMealCatalog',authMiddleware,userController.deleteMealCatalog);  // создаем post запрос на удаление товара из каталога для админа,делаем здесь post запрос,а не delete,так как нужно передать в тело запроса объект товара,который хотим удалить,чтобы брать у этого объекта нужные поля(но можно было сделать и delete запрос,только передавать нужные поля в url к эндпоинту,так как delete запрос не имеет тела запроса)


router.post('/registration',
    body('email').isEmail(),
    body('password').isLength({min:3,max:32}),
    userController.registration); // указываем post запрос для регистрации по маршруту /registration,вторым параметром указываем middleware(функцию body для валидации),указываем в параметре body() названия поля из тела запроса,которое хотим провалидировать(в данном случае это email),и указываем валидатор isEmail() для проверки на email,также валидируем и пароль,но там уже указываем валидатор isLength(),куда передаем объект и поля min(минимальное количество) и max(максимальное) по количеству символов,третьим параметром указываем функцию registration из нашего userController для регистрации,которая будет отрабатывать на этом эндпоинте


router.post('/login',userController.login); // указываем post запрос для логина

router.post('/logout',userController.logout);  // указываем post запрос для выхода из аккаунта

router.get('/refresh',userController.refresh); // указываем get запрос для перезаписывания access токена,если он умер(то есть здесь будем отправлять refresh токен и получать обратно пару access и refresh токенов),если у access токена время действия закончилось,то мы с фронтенда делаем запрос на /refresh,перезаписываем там access и refresh токены(перезаписываем refresh и access токены только в том случае,если refresh токен пользователя еще годен по сроку годности,иначе выдаем ошибку и пользователю нужно будет заново входить в аккаунт,чтобы переобновить refresh токен),и тогда,если аккаунт украли и у мошенника закончилсоь время жизни access токена,то делается запрос на /refresh,но уже у него access и refresh токены не действительны и он не может получить доступ к сервисам,authMiddleware нужен,чтобы защитить пользователя от мошенников,так как,когда истекает access токен,идет запрос на refresh токен,и после этого обновляется и access токен,и refresh токен,соответственно мошенник уже не может получить доступ к этому эндпоинту(маршруту по url),так как его refresh и access токен будут уже не действительны,а функция checkAuth нужна для проверки только refresh токена(то есть,если пользователь вообще не пользовался сервисом какое-то время(которое указали у жизни refresh токена),нужно именно не переобновлять страницы и тд,чтобы не шел запрос на /refresh(иначе refresh токен будет переобновляться с каждым запросом,нужно,чтобы refresh токен истек до запроса на /refresh, также функция checkAuth на фронтенде будет делать запрос на /refresh и тем самым будет проверять,действует ли еще refresh токен пользователя и если еще действует,то обновлять refresh и access токены),то его refresh токен истечет и его выкинет с аккаунта после обновления страницы,но если пользователь будет использовать в данном случае,например,функцию authMiddleware,то его access токен и refresh токен будут заново перезаписаны и таймер на время жизни refresh токена будет обновлен и заново запущен,поэтому его не будет выкидывать из аккаунта) 



export default router;